app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    binding.pry
    @songs = Song.all